using RegularizedOptimization, RegularizedProblems, NLPModels, NLPModelsModifiers, LinearAlgebra, ProximalOperators, Random
using JET
Random.seed!(1234)

compound = 1
bpdn2, bpdn_nls2, sol2 = bpdn_model(compound, bounds = true)
λ = norm(grad(bpdn2, zeros(bpdn2.meta.nvar)), Inf) / 10
options = ROSolverOptions(ν = 1.0, β = 1e16, ϵa = 1e-6, ϵr = 1e-6, verbose = 10)
subsolver_options = deepcopy(options)

x0 = zeros(bpdn_nls2.meta.nvar)
h = NormL0(λ)

LMTR_out = LMTR(
  bpdn_nls2,
  h,
  NormLinf(1.0),
  options,
  x0 = x0,
  subsolver = TRDHSolver,
)

# On master
"""
julia> include("test_script_LMTR.jl")
[ Info:  outer    inner     f(x)     h(x)     √ξ1      √ξ        ρ       Δ     ‖x‖     ‖s‖       ν TR
[ Info:      1        0  2.3e+00  0.0e+00 1.3e+00 1.1e+00  1.0e+00 1.0e+00 0.0e+00 4.9e-01 1.0e+00 ↗
[ Info:      2        0  6.8e-01  4.9e-01 7.8e-01 6.9e-01  1.0e+00 1.5e+00 4.9e-01 2.5e-01 1.0e+00 ↗
[ Info:      3        0  2.1e-01  4.9e-01 4.3e-01 3.8e-01  1.0e+00 1.5e+00 7.4e-01 1.5e-01 1.0e+00 ↗
[ Info:      4        0  7.1e-02  4.9e-01 2.3e-01 2.1e-01  1.0e+00 1.5e+00 8.6e-01 9.3e-02 1.0e+00 ↗
[ Info:      5        0  2.8e-02  4.9e-01 1.3e-01 1.1e-01  1.0e+00 1.5e+00 9.4e-01 5.7e-02 1.0e+00 ↗
[ Info:      6        0  1.5e-02  4.9e-01 7.2e-02 6.4e-02  1.0e+00 1.5e+00 9.8e-01 3.4e-02 1.0e+00 ↗
[ Info:      7        0  1.1e-02  4.9e-01 4.1e-02 3.6e-02  1.0e+00 1.5e+00 1.0e+00 2.1e-02 1.0e+00 ↗
[ Info:      8        0  9.7e-03  4.9e-01 2.3e-02 2.1e-02  1.0e+00 1.5e+00 1.0e+00 1.3e-02 1.0e+00 ↗
[ Info:      9        0  9.2e-03  4.9e-01 1.3e-02 1.2e-02  1.0e+00 1.5e+00 1.0e+00 7.7e-03 1.0e+00 ↗
[ Info:     10        0  9.1e-03  4.9e-01 7.8e-03 7.0e-03  1.0e+00 1.5e+00 1.0e+00 4.7e-03 1.0e+00 ↗
[ Info:     11        0  9.0e-03  4.9e-01 4.6e-03 4.2e-03  1.0e+00 1.5e+00 1.0e+00 2.9e-03 1.0e+00 ↗
[ Info:     12        0  9.0e-03  4.9e-01 2.8e-03 2.5e-03  1.0e+00 1.5e+00 1.0e+00 1.8e-03 1.0e+00 ↗
[ Info:     13        0  9.0e-03  4.9e-01 1.8e-03 1.6e-03  1.0e+00 1.5e+00 1.0e+00 1.1e-03 1.0e+00 ↗
[ Info:     14        0  9.0e-03  4.9e-01 1.1e-03 1.0e-03  1.0e+00 1.5e+00 1.0e+00 7.3e-04 1.0e+00 ↗
[ Info:     15        0  9.0e-03  4.9e-01 7.3e-04 6.7e-04  1.0e+00 1.5e+00 1.0e+00 5.0e-04 1.0e+00 ↗
[ Info:     16        0  9.0e-03  4.9e-01 4.9e-04 4.5e-04  1.0e+00 1.5e+00 1.0e+00 3.4e-04 1.0e+00 ↗
[ Info:     17        0  9.0e-03  4.9e-01 3.3e-04 3.0e-04  1.0e+00 1.5e+00 1.0e+00 2.4e-04 1.0e+00 ↗
[ Info:     18        0  9.0e-03  4.9e-01 2.3e-04 2.1e-04  1.0e+00 1.5e+00 1.0e+00 1.6e-04 1.0e+00 ↗
[ Info:     19        0  9.0e-03  4.9e-01 1.6e-04 1.5e-04  1.0e+00 1.5e+00 1.0e+00 1.1e-04 1.0e+00 ↗
[ Info:     20        0  9.0e-03  4.9e-01 1.1e-04 1.0e-04  1.0e+00 1.5e+00 1.0e+00 8.0e-05 1.0e+00 ↗
[ Info:     21        0  9.0e-03  4.9e-01 7.8e-05 7.2e-05  1.0e+00 1.5e+00 1.0e+00 5.6e-05 1.0e+00 ↗
[ Info:     22        0  9.0e-03  4.9e-01 5.5e-05 5.1e-05  1.0e+00 1.5e+00 1.0e+00 3.9e-05 1.0e+00 ↗
[ Info:     23        0  9.0e-03  4.9e-01 3.9e-05 3.6e-05  1.0e+00 1.5e+00 1.0e+00 2.8e-05 1.0e+00 ↗
[ Info:     24        0  9.0e-03  4.9e-01 2.8e-05 2.5e-05  1.0e+00 1.5e+00 1.0e+00 2.0e-05 1.0e+00 ↗
[ Info:     25        0  9.0e-03  4.9e-01 2.0e-05 1.8e-05  1.0e+00 1.5e+00 1.0e+00 1.4e-05 1.0e+00 ↗
[ Info:     26        0  9.0e-03  4.9e-01 1.4e-05 1.3e-05  1.0e+00 1.5e+00 1.0e+00 9.7e-06 1.0e+00 ↗
[ Info:     27        0  9.0e-03  4.9e-01 9.8e-06 9.1e-06  1.0e+00 1.5e+00 1.0e+00 6.9e-06 1.0e+00 ↗
[ Info:     28        0  9.0e-03  4.9e-01 7.0e-06 6.5e-06  1.0e+00 1.5e+00 1.0e+00 4.9e-06 1.0e+00 ↗
[ Info:     29        0  9.0e-03  4.9e-01 5.0e-06 4.6e-06  1.0e+00 1.5e+00 1.0e+00 3.5e-06 1.0e+00 ↗
[ Info:     30        0  9.0e-03  4.9e-01 3.5e-06 3.3e-06  1.0e+00 1.5e+00 1.0e+00 2.4e-06 1.0e+00 ↗
[ Info:     31        0  9.0e-03  4.9e-01 2.5e-06 2.3e-06  1.0e+00 1.5e+00 1.0e+00 1.7e-06 1.0e+00 ↗
[ Info:     32        1  9.0e-03  4.9e-01 1.8e-06 1.8e-06          1.5e+00 1.0e+00 1.2e-06 1.0e+00
[ Info: LMTR: terminating with √ξ1 = 1.7795193545276022e-6
"Execution stats: first-order stationary"
"""